Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Note that, if you want to push the validation errors to the frontend, you have to catch the exception and push the information yourselves as they will not be automatically pushed to the JSON output.
ja_jp: 検証エラーをフロントエンドにプッシュしたい場合は、例外をキャッチして自分で情報をプッシュしなければなりません。

source: Note that, similarly to what we do with the configuration property, we take into account the annotated package but also all its subpackages.
ja_jp: 設定プロパティーで行うのと同様で、アノテーションのつけられたパッケージだけでなく、そのすべてのサブパッケージも入れていることに注意してください。

source: Note the _content-id_ format and reference. By spec, when you create the inline attachment, the content-id must be structured as follows: `<id@domain>`. If you don't wrap your content-id between `<>`, it is automatically wrapped for you. When you want to reference your attachment, for instance in the `src` attribute, use `cid:id@domain` (without the `<` and `>`).
ja_jp: _content-id_ 形式と参照に注意してください。仕様上、インライン添付ファイルを作成する場合は content-id を `<id@domain>` にする必要があります。content-id を `<>` で囲わない場合、自動的に囲われます。添付ファイルを `src` 属性などで参照する必要がある場合は、 `cid:id@domain` (`<` and `>` は除外) を使用します。

source: Note the `alg` (algorithm) header is set to `RS256` by default. Signing key identifier (`kid` header) does not have to be set if a single JSON Web Key (JWK) containing a `kid` property is used.
ja_jp: `alg` (アルゴリズム) ヘッダーはデフォルトで `RS256` に設定されていることに注意してください。 `kid` プロパティーを含む単一の JSON Web Key (JWK) を使用する場合、署名キー識別子 ( `kid` ヘッダー) を設定する必要はありません。

source: Note the `alg` (key management algorithm) header is set to `RSA-OAEP` and the `enc` (content encryption header) is set to `A256GCM` by default.
ja_jp: デフォルトでは、 `alg` (キー管理アルゴリズム) ヘッダーが `RSA-OAEP` に設定され、 `enc` (コンテンツ暗号化ヘッダー) が `A256GCM` に設定されていることに注意してください。

source: Note the `jdbc` prefix in the property name. All JDBC-specific configuration properties have the `jdbc` prefix. For reactive datasources, the prefix is `reactive`.
ja_jp: プロパティー名の `jdbc` 接頭辞に注意してください。 すべての JDBC 固有の設定プロパティーには `jdbc` 接頭辞が付きます。 リアクティブデータソースの場合、接頭辞は `reactive` です。

source: Note the `jdbc` prefix in the property name. All the configuration properties specific to JDBC have the `jdbc` prefix. For reactive datasources, the prefix is `reactive`.
ja_jp: プロパティ名の接頭辞 `jdbc` に注意してください。JDBC 固有の設定プロパティにはすべて、接頭語に `jdbc` が付きます。Reactiveデータソースの場合、接頭辞は `reactive` です。

source: Note the `jdbc` prefix in the property name. All the configuration properties specific to JDBC have this prefix.
ja_jp: プロパティー名の接頭辞 `jdbc` に注意してください。JDBC に固有のすべての設定プロパティーには、この接頭辞があります。

source: Note the `optional` attribute.
ja_jp: `optional` 属性に注意してください。

source: Note the `sign` step can be combined with the <<encrypt-claims, encrypt>> step to produce `inner-signed and encrypted` tokens, see <<innersign-encrypt-claims, Sign the claims and encrypt the nested JWT token>> section.
ja_jp: `sign` ステップは、<<encrypt-claims, encrypt>> ステップと組み合わせて `inner-signed and encrypted` を生成することもできることに注意してください。詳細は、<<innersign-encrypt-claims, クレームへの署名とネストされた JWT トークンの暗号化>> セクションを参照してください。

source: Note the `sign` step can be combined with the xref:encrypt-claims[encrypt] step to produce `inner-signed and encrypted` tokens, see xref:innersign-encrypt-claims[Sign the claims and encrypt the nested JWT token] section.
ja_jp: `sign` ステップは、 `inner-signed and encrypted` トークンを生成するために xref:encrypt-claims[encrypt] ステップと組み合わせることができることに注意してください。 xref:innersign-encrypt-claims[クレームへの署名とネストされたJWTトークンの暗号化] セクションを参照してください。

source: Note the `tenant-a` application type is `hybrid` - it can accept HTTP bearer tokens if provided, otherwise it will initiate an authorization code flow when the authentication is required.
ja_jp: `tenant-a` アプリケーションタイプは `hybrid` であることに注意してください。HTTPベアラートークンが提供された場合はそれを受け入れることができますが、そうでない場合は認証が必要なときに認可コードフローが開始されます。

source: Note the addition of `-kotlin` on the end. Generally you'll only need this version but if your project will be using both Java and Kotlin code, you can safely include both artifacts.
ja_jp: 最後に `-kotlin` が追加されていることに注意してください。通常はこのバージョンのみが必要ですが、プロジェクトでJavaとKotlinの両方のコードを使用する場合は、両方のアーティファクト含めても大丈夫です。

source: Note the addition of the public `/hello/post-logout` resource method.
ja_jp: パブリック `/hello/post-logout` リソースメソッドが追加されたことに注意してください。

source: Note the alias is set to `saml`, `Redirect URI` is `http://localhost:8081/realms/quarkus/broker/saml/endpoint` and `Service provider entity ID` is `http://localhost:8081/realms/quarkus` - these are the same values you entered when creating the Okta SAML integration in the previous step.
ja_jp: エイリアスは `saml` に設定され、 `Redirect URI` は `http://localhost:8081/realms/quarkus/broker/saml/endpoint` で、 `Service provider entity ID` は `http://localhost:8081/realms/quarkus` である点に注意してください。これらは、前の手順で Okta SAML Integration を作成するときに入力した値と同じです。

source: Note the alias is set to `saml`, `Redirect URI` is `http://localhost:8081/realms/quarkus/broker/saml/endpoint`, and `Service provider entity ID` is `http://localhost:8081/realms/quarkus` - these are the same values you entered when creating the Okta SAML integration in the previous step.
ja_jp: エイリアスは `saml` に設定され、 `Redirect URI` は `http://localhost:8081/realms/quarkus/broker/saml/endpoint` で、 `Service provider entity ID` は `http://localhost:8081/realms/quarkus` である点に注意してください。これらは、前の手順で Okta SAML Integration を作成するときに入力した値と同じです。

source: Note the alias is set to `saml`, `Redirect URI` is `http:localhost:8081/realms/quarkus/broker/saml/endpoint` and `Service provider entity ID` is `http:localhost:8081/realms/quarkus` - these are the same values you entered when creating the Okta SAML integration in the previous step.
ja_jp: エイリアスは `saml` に設定され、 `Redirect URI` は `http:localhost:8081/realms/quarkus/broker/saml/endpoint` で、 `Service provider entity ID` は `http:localhost:8081/realms/quarkus` である点に注意してください。これらは、前の手順で Okta SAML Integration を作成するときに入力した値と同じです。

source: Note the method `getAll` corresponds to the method in your Java Service. This method returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise] with the JsonRPC result.
ja_jp: `getAll` メソッドは、Java サービスのメソッドに対応していることに注意してください。このメソッドは、JsonRPC の結果を含む https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise] を返します。

source: Note the method `getJoke` corresponds to the method in your Java Service. This method returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise] with the JsonRPC result.
ja_jp: `getJoke` メソッドは Java サービスのメソッドに対応していることに注意してください。このメソッドは、JsonRPC の結果を含む https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise] を返します。

source: Note the usage of `MutinyMappedReactiveResultSet` - it is a specialized `Mutiny` type converted from the original `Publisher` returned by the driver, which also exposes a few extra methods, e.g. to obtain the query execution info. If you don't need anything in that interface, you can also simply declare your method to return `Multi`: `Multi<Fruit> findAll()`,
ja_jp: `MutinyMappedReactiveResultSet` の使い方に注意してください。これは、ドライバが返すオリジナルの `Publisher` から変換された特殊な `Mutiny` 型で、クエリの実行情報を取得するなど、いくつかの追加メソッドも公開されています。このインターフェイスで何も必要としない場合は、単純に `Multi` を返すようにメソッドを宣言することもできます: `Multi<Fruit> findAll()` 、

source: Note the usage of an `Emitter<Record<K, V>>`
ja_jp: `Emitter<Record<K, V>>` の使用方法に注意してください。

source: Note this user session can not be extended forever - the returning user with the expired ID token will have to re-authenticate at the OIDC provider endpoint once the refresh token has expired.
ja_jp: このユーザーセッションは永久に延長されるわけではありません。リフレッシュトークンの有効期限が切れると、ID トークンを持つ復帰ユーザーは OIDC プロバイダーのエンドポイントで再認証を行う必要があります。

source: Note two encryption operations are done when creating an ecrypted token:
ja_jp: 暗号化されたトークンを作成する際に、2つの暗号化処理が行われることに注意してください:

source: Note two encryption operations are done when creating an encrypted token:
ja_jp: 暗号化されたトークンを作成する際には、2つの暗号化処理が行われることに注意してください。

source: Note we don't need to specify a path here, as `/hello` is the default for this test
ja_jp: このテストでは `/hello` がデフォルトなので、ここでパスを指定する必要はないことに注意してください。

source: Note you can also use the injected `JsonWebToken` to access the individual claims in which case setting `@RequestScoped` is not necessary.
ja_jp: 注入された `JsonWebToken` を使用して個々のクレームにアクセスすることもできます。その場合、 `@RequestScoped` を設定する必要はありません。

source: Note you can also use the injected `JsonWebToken` to access the individual claims, but setting `@RequestScoped` is unnecessary in this case.
ja_jp: 注入された `JsonWebToken` を使用して個々のクレームにアクセスすることもできますが、この場合は `@RequestScoped` を設定する必要はありません。

source: Note you can use Smallrye JWT Build API without having to create MicroProfile JWT endpoints supported by `quarkus-smallrye-jwt`. It can also be excluded from `quarkus-smallrye-jwt` if MP JWT endpoints do not need to generate JWT tokens.
ja_jp: `quarkus-smallrye-jwt` でサポートされている MicroProfile JWT エンドポイントを作成しなくても、Smallrye JWT Build API を使用できることに留意してください。MP JWT エンドポイントが JWT トークンを生成する必要がない場合は、 `quarkus-smallrye-jwt` から除外することもできます。

source: Note, `quarkus.oidc.authentication.session-age-extension` can be important when dealing with expired ID tokens, when the user is not very active. In such cases, if the ID token expires, then the session cookie may not be returned back to the Quarkus endpoint during the next user request and Quarkus will assume it is the first authentication request. Therefore using `quarkus.oidc.authentication.session-age-extension` is important if you need to have even the expired ID tokens refreshed.
ja_jp: なお、 `quarkus.oidc.authentication.session-age-extension` は、ユーザーがあまりアクティブでない場合に、期限切れの ID トークンを扱うときに重要になることがあります。このような場合、IDトークンの有効期限が切れると、次のユーザーリクエストの際にセッションクッキーがQuarkusエンドポイントに返されず、Quarkusはそのリクエストを最初の認証リクエストとみなしてしまう可能性があります。そのため、期限切れのIDトークンもリフレッシュさせる必要がある場合は、 `quarkus.oidc.authentication.session-age-extension` を使用することが重要です。

source: Note, `quarkus.oidc.authentication.session-age-extension` can be important when dealing with expired ID tokens, when the user is not very active. In such cases, if the ID token expires, then the session cookie may not be returned to the Quarkus endpoint during the next user request and Quarkus will assume it is the first authentication request. Therefore, using `quarkus.oidc.authentication.session-age-extension` is important if you need to have even the expired ID tokens refreshed.
ja_jp: `quarkus.oidc.authentication.session-age-extension` は、ユーザーがあまりアクティブでないときに、期限切れの ID トークンを処理するときに重要になる可能性があることに注意してください。このような場合、ID トークンの有効期限が切れると、セッション Cookie は次のユーザーリクエスト中に Quarkus エンドポイントに戻されない可能性があり、Quarkus はそれが最初の認証リクエストであると見なします。したがって、期限切れの ID トークンを更新する必要がある場合は、 `quarkus.oidc.authentication.session-age-extension` を使用することが重要です。

source: Note, as you will see, STM in Quarkus relies on a number of annotations to define behaviours. The lack of these annotations causes sensible defaults to be assumed but it is important for the developer to understand what these may be. Please refer to the https://narayana.io/docs/project/index.html#d0e16066[Narayana STM manual] and the https://narayana.io//docs/project/index.html#d0e16133[STM annotations guide] for more details on all of the annotations Narayana STM provides.
ja_jp: ご覧のように、Quarkus の STM は、動作を定義するために多くのアノテーションに依存しています。これらのアノテーションがないために、適切なデフォルトが仮定されますが、開発者はこれらのアノテーションが何であるかを理解することが重要です。Narayana STM が提供するすべてのアノテーションの詳細については、 https://narayana.io/docs/project/index.html#d0e16066[Narayana STM manual] と https://narayana.io//docs/project/index.html#d0e16133[STM アノテーションガイド] を参照してください。

source: Note, as you will see, STM in Quarkus relies on a number of annotations to define behaviours. The lack of these annotations causes sensible defaults to be assumed, but it is important for the developer to understand what these may be. Please refer to the https://narayana.io/docs/project/index.html#d0e16066[Narayana STM manual] and the https://narayana.io//docs/project/index.html#d0e16133[STM annotations guide] for more details on all the annotations Narayana STM provides.
ja_jp: ご覧のように、Quarkus の STM は、動作を定義するために多くのアノテーションに依存しています。これらのアノテーションがないために、適切なデフォルトが仮定されますが、開発者はこれらのアノテーションが何であるかを理解することが重要です。Narayana STM が提供するすべてのアノテーションの詳細については、 https://narayana.io/docs/project/index.html#d0e16066[Narayana STM manual] と https://narayana.io//docs/project/index.html#d0e16133[STM アノテーションガイド] を参照してください。

source: Note, even though you will configure the extension to support the authorization code flows without `IdToken`, an internal `IdToken` will be generated to support the way `quarkus-oidc` operates where an `IdToken` is used to support the authentication session and to avoid redirecting the user to the provider such as GitHub on every request. In this case the session lifespan is set to 5 minutes which can be extended further as described in the <<session-management,session management>> section.
ja_jp: 注意: `IdToken` なしで認可コードのフローをサポートするようにエクステンションを設定しても、 `quarkus-oidc` の動作をサポートするために内部で `IdToken` が生成され、 `IdToken` は認証セッションをサポートし、リクエストごとに GitHub などのプロバイダーにリダイレクトされるのを回避するために使用されます。この場合、セッションの有効期限は 5 分に設定されていますが、<<session-management,セッション管理>> セクションで説明するように、さらに延長することができます。

source: Note, even though you will configure the extension to support the authorization code flows without `IdToken`, an internal `IdToken` will be generated to support the way `quarkus-oidc` operates where an `IdToken` is used to support the authentication session and to avoid redirecting the user to the provider such as `GitHub` on every request. In this case the session lifespan is set to 5 minutes which can be extended further as described in the <<session-management,session management>> section.
ja_jp: `IdToken` を使用せずに認可コードフローをサポートするようにエクステンションを構成しても、 `quarkus-oidc` の動作方法をサポートするために内部 `IdToken` が生成されます。 `IdToken` は、認証セッションをサポートし、リクエストごとにユーザーを `GitHub` などのプロバイダーにリダイレクトすることを避けるために使用されています。この場合、セッションの寿命は5分に設定され、 xref:session-management[セッション管理] のセクションで説明されているように、さらに延長することができます。

source: Note, however, that despite being able to get a backtrace we can still not list the source code at point with the `list` command.
ja_jp: ただし、バックトレースを取得できるにもかかわらず、 `list` コマンドを使用してソースコードをある点で引き続き一覧表示できないことに注意してください。

source: Note, however, that there is a price you pay for that potentially higher JVM speed, and that price is in increased resource usage (both CPU and memory) and startup time because:
ja_jp: ただし、JVMの速度が向上する可能性があるため、その代償として、リソース（CPUとメモリの両方）の使用量と起動時間が増加することに注意してください。

source: Note, that similarly to the `ServiceDiscoveryProvider`, the `LoadBalancerProvider` interface takes a configuration class as a parameter. This configuration class is generated automatically by the _Configuration Generator_. Its name is created by appending `Configuration` to the name of the provider class.
ja_jp: なお、 `ServiceDiscoveryProvider` と同様に、 `LoadBalancerProvider` インターフェースもパラメータとして設定クラスを受け取ります。この設定クラスは、 _Configuration Generator_ によって自動的に生成されます。その名前は、プロバイダークラスの名前に `Configuration` を付加して作成されます。

source: Note, the STM implementation provided by Quarkus is based on the https://narayana.io/docs/project/index.html#d0e16066[Narayana STM] implementation. This document isn't meant to be a replacement for that project's documentation so you may want to look at that for more detail. However, we will try to focus more on how you can combine some of the key capabilities into Quarkus when developing Kubernetes native applications and microservices.
ja_jp: Quarkusが提供するSTMの実装は、 link:https://narayana.io/docs/project/index.html#d0e16066[Narayana STM] の実装に基づいています。このドキュメントは、そのプロジェクトのドキュメントに代わるものではありませんので、詳細についてはそちらを参照してください。しかし、Kubernetesネイティブアプリケーションやマイクロサービスを開発する際に、主要な機能のいくつかをQuarkusにどのように組み合わせることができるかについて、より焦点を当ててみたいと思います。

source: Note, the term "container" was defined within the STM implementation years before Linux containers came along. It may be confusing to use especially in a Kubernetes native environment such as Quarkus, but hopefully the reader can do the mental mapping.
ja_jp: 注意: "コンテナー" という用語は、Linux コンテナーが登場する何年も前に STM の実装で定義されていました。特に Quarkus のような Kubernetes ネイティブ環境で使用すると混乱するかもしれませんが、読者の方には柔軟に理解していただければと思います。

source: Note, there are a couple `INFO` messages informing the user that the values for certain options Quarkus uses by default in Dev mode were overridden by the extension preferences. Specifically, the C2 compiler was re-enabled and the debug mode was disabled. A user can still choose to enable the debug agent and disable the C2 compilter if necessary by explicitly setting the corresponding Quarkus Maven or Gradle plugin parameter values.
ja_jp: なお、INFO メッセージがいくつか表示され、開発モードで Quarkus がデフォルトで使用する特定のオプションの値が、エクステンションの設定によって上書きされたことをユーザーに通知します。具体的には、C2 コンパイラーが再度有効化され、デバッグモードが無効化されました。ただし、ユーザーは必要に応じて、対応する Quarkus Maven または Gradle プラグインのパラメーター値を明示的に設定することで、デバッグエージェントを有効化し、C2 コンパイラーを無効化することも可能です。

source: Note: At the time of writing there is no mechanism in place that allows a one to many relationship between provided and generated files. Minikube is not an exception to the rule above, so if you want to customize the generated minikube manifests, the file placed under `src/main/kubernetes` will have to be named `minikube.json` or `minikube.yml` (naming it `kubernetes.yml` or `kubernetes.json` will result in having only the generated `kubernetes.yml` and `kubernetes.json` affected).
ja_jp: 注記: 執筆時点では、提供ファイルと生成ファイルの間に一対多の関係を可能にするメカニズムは存在しません。Minikube も上記の例外ではないため、生成された minikube マニフェストをカスタマイズしたい場合は、 `src/main/kubernetes` 配下のファイルの名前を `minikube.json` または `minikube.yml` にしなければなりません (名前を `kubernetes.yml` または `kubernetes.json` にすると、生成した `kubernetes.yml` と `kubernetes.json` のみが影響を受けることになります)。

source: Note: At the time of writing there is no mechanism in place that allows a one-to-many relationship between provided and generated files. Minikube is not an exception to the rule above, so if you want to customize the generated minikube manifests, the file placed under `src/main/kubernetes` will have to be named `minikube.json` or `minikube.yml` (naming it `kubernetes.yml` or `kubernetes.json` will result in having only the generated `kubernetes.yml` and `kubernetes.json` affected).
ja_jp: 注記: 執筆時点では、提供ファイルと生成ファイルの間に一対多の関係を可能にするメカニズムは存在しません。Minikube も上記の例外ではないため、生成された minikube マニフェストをカスタマイズしたい場合は、`src/main/kubernetes` 配下のファイルの名前を `minikube.json` または `minikube.yml` にしなければなりません (名前を `kubernetes.yml` または `kubernetes.json` にすると、生成した `kubernetes.yml` と `kubernetes.json` のみが影響を受けることになります)。

source: Note: By default the `@RegisterForReflection` annotation will also register any potential nested classes for reflection. If you want to avoid this behavior, you can set the `ignoreNested` attribute to `true`.
ja_jp: 注記: デフォルトでは、`@RegisterForReflection` アノテーションは、リフレクションの対象となる可能性のあるネストされたクラスも登録します。この動作を回避するには、`ignoreNested` 属性を `true` に設定します。

source: Note: For `web-app` type applications, ID token roles are checked by default.
ja_jp: 注記: `web-app` タイプのアプリケーションの場合、ID トークンのロールはデフォルトでチェックされます。

source: Note: If you want to use the `AuthzClient` directly make sure to set `quarkus.keycloak.policy-enforcer.enable=true` otherwise there is no Bean available for injection.
ja_jp: Note: `AuthzClient` を直接使用する場合は、必ず `quarkus.keycloak.policy-enforcer.enable=true` を設定してください。そうしないと、インジェクションに使用できる Bean がありません。

source: Note: JBang debugging always suspends thus you need to connect the debugger to have the application run.
ja_jp: 注意: `jbang` デバッグは常に一時停止しているため、アプリケーションを実行させためるにはデバッガーを接続する必要があります。

source: Note: The current implementation is still using injection site to determine the root set, so to avoid migration problems, it is recommended that the injection site (field or parameter) have the same name as the configuration root class until this change is complete.
ja_jp: 注: 現在の実装では引き続きインジェクションサイトを使用してルートセットを決定しています。そのため、移行の問題を回避するには、この変更が完了するまで、インジェクションサイト (フィールドまたはパラメーター) に設定ルートクラスと同じ名前を付けることをお勧めします。

source: Note: This configuration instructs the `protobuf-maven-plugin` to generate default gRPC classes and classes using Mutiny to fit with the Quarkus development experience.
ja_jp: 注記: この設定は、Quarkus 開発エクスペリエンスに適合するように、 `protobuf-maven-plugin` にデフォルトの gRPC クラスと Mutiny を使用するクラスを生成するように指示します。

source: Note: Users may use both properties at the same time.
ja_jp: 注：ユーザーは両方のプロパティーを同時に使用することができます。

source: Note: both `resteasy-jackson` and `resteasy-jsonb` are supported and can be interchanged.
ja_jp: 注： `resteasy-jackson` と `resteasy-jsonb` の両方がサポートされており、交換することができます。

source: Note: default values are subject to change. Using the `--dry-run` option will show you the computed value.
ja_jp: 注意：デフォルト値は変更されることがあります。 `--dry-run` オプションを使用すると、計算された値が表示されます。

source: Note: the emoji shown above may not match precisely. The appearance of emoji can vary by font, and terminal/environment. IntelliJ IDEA, for example, has several long-running issues open regarding the behavior/rendering of emoji in the terminal.
ja_jp: 注記: 上記の絵文字は正確に一致しない場合があります。絵文字の表示は、フォント、端末/環境によって異なる場合があります。たとえば、IntelliJ IDEA には、ターミナルでの絵文字の動作/レンダリングに関して、いくつかの長期にわたる問題があります。

source: Note: you can see <<action-example,how to invoke this action from your full page>>.
ja_jp: NOTE: link:#action-example[アクションを呼び出す方法は、ページ全体から見る] ことができます。

source: Note: you can see xref:action-example[how to invoke this action from your full page].
ja_jp: 注： xref:action-example[このアクションを呼び出す方法はあなたのフルページ] で確認することができます。

source: Notes
ja_jp: 備考

source: Notes on Transformer Safety
ja_jp: Transformer の安全性に関する注意事項

source: Nothing fancy. One important thing to note is that having a default constructor is required by the JSON serialization layer.
ja_jp: 派手なことは何もありません。注意すべき重要なことは、デフォルトのコンストラクタを持つことはJSONシリアライズレイヤーで必須であるということです。

source: Nothing groundbreaking here: just a few CRUD operations in a REST service, using Hibernate Search APIs.
ja_jp: 画期的なことは何もありません。REST サービスで CRUD 操作をいくつか行うだけ、 その際に、Hibernate Search API を使用します。

source: Nothing needed in IntelliJ IDEA because the IDE will pick the `systemPropertyVariables` from the surefire plugin configuration in `pom.xml`.
ja_jp: IntelliJ IDEA では何も必要ありません。なぜなら、IDEは `systemPropertyVariables` を `pom.xml` の surefire プラグイン設定から取得するからです。

source: Nothing needed in IntelliJ because the IDE will pick the `systemPropertyVariables` from the surefire plugin configuration in `pom.xml`.
ja_jp: IntelliJでは何も必要ありません。なぜなら、IDEは `systemPropertyVariables` を `pom.xml` のsurefireプラグイン設定から取得するからです。

source: Nothing out of the ordinary here: it is just good old Hibernate ORM with Panache operations in a REST service.
ja_jp: 特別なことは何もありません。RESTサービスでのPanacheの処理と古き良きHibernateです。

source: Nothing out of the ordinary here: it is just good old Hibernate ORM with Panache operations in a standard JAX-RS service.
ja_jp: ここでは何も特別なことはありません。標準的なJAX-RSサービスでPanache操作を行う古き良きHibernate ORMです。

source: Nothing spectacular here. On each received quote, it updates the page.
ja_jp: ここでは、特筆すべきものは何もありません。受け取った見積もりごとに、ページが更新されます。

source: Nothing spectacular here. When the user clicks the button, HTTP request is made to request a quote, and a pending quote is added to the list. On each quote received over SSE, the corresponding item in the list is updated.
ja_jp: ここでは何も特別なことはありません。ユーザーがボタンをクリックすると、見積をリクエストするための HTTP リクエストが作成され、保留中の見積がリストに追加されます。SSE を介して受け取った見積もりごとに、リスト内の対応するアイテムが更新されます。

source: Nothing spectacular here. On each fetch, it updates the page.
ja_jp: 特筆すべきものは何もありません。フェッチするたびにページが更新されます。

source: Notice how `ConstraintVerifier` ignores the constraint weight during testing - even if those constraint weights are hard coded in the `ConstraintProvider` - because constraints weights change regularly before going into production. This way, constraint weight tweaking does not break the unit tests.
ja_jp: 制約の重みは本番環境に入る前に定期的に変更されるため、 `ConstraintVerifier` は (その制約の重みが `ConstraintProvider` にハードコーディングされている場合でも) テスト中は制約の重みを無視することに注意してください。このように、制約の重みを微調整してもユニットテストが中断されることはありません。

source: Notice how `FruitResource` is being injected a `FruitService` instance automatically.
ja_jp: `FruitResource` が `FruitService` インスタンスを自動的に注入していることに注目してください。
